# IsOffsetLengthRequired Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHookType..::..IsOffsetLengthRequired Method
RebarHookType Class See Also
---
Check whether hook offset length is required. remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful. returns: True if hook offset length is required, otherwise false.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsOffsetLengthRequired()
```

Visual Basic
---
```text
Public Function IsOffsetLengthRequired As Boolean
```

Visual C++
---
```text
public:
bool IsOffsetLengthRequired()
```

# See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace